## 1.	Consider a large dataset (say, a time series) A. Also, consider a smaller dataset B. 
## How do you ensure whether sets A and B identify the same variable? Illustrate it with a Python script.

In [1]:
# Importing libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline
import warnings
warnings.filterwarnings("ignore")

In [4]:
# Import the dataset A
data=pd.read_csv("DailyTemprature.csv")

In [5]:
data

            Date Daily minimum temperatures
0       1/1/1981                       20.7
1       1/2/1981                       17.9
2       1/3/1981                       18.8
3       1/4/1981                       14.6
4       1/5/1981                       15.8
...          ...                        ...
3645  12/27/1990                         14
3646  12/28/1990                       13.6
3647  12/29/1990                       13.5
3648  12/30/1990                       15.7
3649  12/31/1990                         13

[3650 rows x 2 columns]

In [6]:
#Basic Checks
data.head()

       Date Daily minimum temperatures
0  1/1/1981                       20.7
1  1/2/1981                       17.9
2  1/3/1981                       18.8
3  1/4/1981                       14.6
4  1/5/1981                       15.8

In [7]:
data.tail()

            Date Daily minimum temperatures
3645  12/27/1990                         14
3646  12/28/1990                       13.6
3647  12/29/1990                       13.5
3648  12/30/1990                       15.7
3649  12/31/1990                         13

In [8]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3650 entries, 0 to 3649
Data columns (total 2 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Date                        3650 non-null   object
 1   Daily minimum temperatures  3650 non-null   object
dtypes: object(2)
memory usage: 57.2+ KB

In [9]:
data.describe()

            Date Daily minimum temperatures
count       3650                       3650
unique      3650                        230
top     1/1/1981                         11
freq           1                         51

In [14]:
data.isnull().sum() # Getting the number of null values

Date                          0
Daily minimum temperatures    0
dtype: int64

- There is no null values

In [15]:
data.shape

(3650, 2)

In [16]:
data.nunique() # number of unique values

Date                          3650
Daily minimum temperatures     230
dtype: int64

In [38]:
#Loading Dataset B
data1=pd.read_csv("DailyTemprature1.csv")

In [39]:
data1

          Date  Dailyminimumtemperatures
0    3/13/1981                      11.8
1    3/14/1981                      11.3
2    3/15/1981                      10.6
3    3/24/1981                      13.4
4    4/28/1981                       9.3
5    4/29/1981                       9.9
6    4/30/1981                       7.4
7   12/27/1990                      14.0
8   12/28/1990                      13.6
9   12/29/1990                      13.5
10  12/30/1990                      15.7
11  12/31/1990                      13.0
12  10/14/1990                       7.7
13  10/15/1990                      15.8
14  10/16/1990                      14.6
15  10/17/1990                      10.5
16  10/18/1990                      11.3
17   6/26/1981                       7.3
18   6/27/1981                       9.2
19   6/28/1981                      10.2
20   7/20/1981                      11.0
21   7/21/1981                      22.0
22   7/22/1981                       9.0
23   8/21/1990                      10.0
24   9/23/1982                       8.0
25   7/22/1981                       7.0
26  10/15/1983                      12.3
27   9/20/1985                      23.0
28   9/20/1989                      24.0

In [40]:
#Basic Checks
data1.head()

        Date  Dailyminimumtemperatures
0  3/13/1981                      11.8
1  3/14/1981                      11.3
2  3/15/1981                      10.6
3  3/24/1981                      13.4
4  4/28/1981                       9.3

In [41]:
data1.tail()

          Date  Dailyminimumtemperatures
24   9/23/1982                       8.0
25   7/22/1981                       7.0
26  10/15/1983                      12.3
27   9/20/1985                      23.0
28   9/20/1989                      24.0

In [42]:
data1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29 entries, 0 to 28
Data columns (total 2 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Date                      29 non-null     object
 1   Dailyminimumtemperatures  29 non-null     float64
dtypes: float64(1), object(1)
memory usage: 592.0+ bytes

In [43]:
data1.describe()

       Dailyminimumtemperatures
count                 29.000000
mean                  12.289655
std                    4.448382
min                    7.000000
25%                    9.300000
50%                   11.300000
75%                   13.600000
max                   24.000000

In [44]:
data1.isnull().sum() # Getting the number of null values

Date                        0
Dailyminimumtemperatures    0
dtype: int64

In [45]:
data1.shape

(29, 2)

In [46]:
data1.nunique() # number of unique values

Date                        28
Dailyminimumtemperatures    28
dtype: int64

In [47]:
data1['Dailyminimumtemperatures'] = data1.Dailyminimumtemperatures.astype("str")

In [48]:
data1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29 entries, 0 to 28
Data columns (total 2 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Date                      29 non-null     object
 1   Dailyminimumtemperatures  29 non-null     object
dtypes: object(2)
memory usage: 592.0+ bytes

In [50]:
#Comparing the datasets to get similar data[temperatre]
data1['temperaturematch'] = np.where(data['Daily minimum temperatures'] == data1['Dailyminimumtemperatures'].values)

ValueError: ('Lengths must match to compare', (3650,), (29,))